<script lang="ts" setup>
import ExternalLink from '/@/components/ExternalLink.vue';
</script>

<template>
  <div>
    <span class="glory">Слава Україні!</span>
    <details>
      <summary>
        <span>Деталі</span>
      </summary>

      <p>
        Хочу занотувати тут кілька важливих для себе тез, про які має знати кожен. Я пишу це українською, бо мені так
        зручніше. Хто не розуміє і хоче зрозуміти — може скористатись перекладачем. А хто не хоче зрозуміти, тому це і
        не потрібно. Я буду висловлюватись жорстко та грубо. Якщо ви боїтесь зламати рожеві окуляри — краще не читайте.
      </p>

      <h2>Війна та окупація</h2>
      <p>
        24.02.2022 розпочалось
        <external-link href="https://bellingcat.com/">
          повномасштабне вторгнення в Україну
        </external-link>
        з метою
        захоплення її територій. Будь-які заперечення
        цього факту — це ніщо інше як спроби підігнати реальність під власні чи навіяні уявлення про світ і те, яким ви
        хочете його бачити. Я знаю, нелегко визнати себе і свою країну терористами. Але виправдання тут немає і не може
        бути.
        <external-link
          href="https://www.icj-cij.org/public/files/case-related/182/182-20220316-SUM-01-00-EN.pdf"
        >
          Росія творить Геноцид Українського народу
        </external-link>
        . Це не вперше і не в останнє. Будь який аргумент у виправдання
        війни — це все одно що захищати вбивць і ґвалтівників.
      </p>

      <p>
        <external-link href="https://uaposition.github.io/uainfo/">
          Додаткова інформація для жителів РФ
        </external-link>
      </p>
      <p>
        <external-link href="https://www.youtube.com/watch?v=5YlyCauul8A">
          К чему приводит «защита русского мира»
        </external-link>
      </p>

      <h2>Як у нас справи</h2>
      <p>
        Я втратив роботу. Компанія, в якій я працював, на межі банкротства. Я не знаю, що з моїм домом. Не здивуюсь,
        якщо на його місці лише груда каміння. Я втратив контакт з деякими людьми, які допомагали в розробці цього
        додатку. Не знаю що з ними, де вони і чи живі взагалі.
      </p>

      <p>
        Як я і писав раніше — цей додаток не буде розвиватись допоки війна не закінчиться.
      </p>

      <h2>Винні всі</h2>
      <p>
        Так. Я не вважаю, що винен у цій війні лише путін. Всі тези і висловлювання в стилі "убивает не солдат, убивает
        пуля и путин" — жалюгідні спроби зняти вину конкретно з себе і перекласти їх на когось ще. Я глибоко
        переконаний, що всі ці тренди "Мы за мир" — це не російська свідома позиція, а результат дій України. Якби
        Україну було захоплено за 3 дні, як і планувалось, то всі ті, хто зараз нібито проти війни, билися б в оргазмі і
        кричали "КРЫМНАШ", "ДАМБАСНАШ", "УКРАИНАНАШ", "БЕЛАРУСЬ ДАВАЙ К НАМ" і так далі. Я вважаю цих людей злодіями,
        які шкодують не через злочин, а через те, що їх упіймали.
      </p>

      <h2>Русофобія</h2>
      <p>
        Всі росіяни заляпані у цьому гівні. Ваша репутація вже нижче немає куди. І немає способу виправдатись. Все що ви
        можете, це реабілітуватись. В більшості росіян ненавидять. Це факт. Не тільки в Україні, по світу. Вам знайомий
        стереотип араба-шахіда? Всі ці безкінечні меми, про арабів, терористів і так далі? Все це почалось після 11
        вересня 2001 — після терористичного акту. А як довго всіх підряд німців класифікували нацистами і ненавиділи?
      </p>
      <p>
        Розумієте? Тепер з ними в один ряд встали і росіяни. Не може бути хороших і поганих росіян. Якась частина
        російської нації коїть жахливі речі від імені цієї нації. Це ганьба на весь рід. Повторюсь, ніхто з росіян не
        може себе виправдати, а будь які спроби виглядають лицемірно і мерзотно. Єдиний варіант — прийняти свою нову
        репутацію і реабілітуватись.
      </p>

      <h2>Хочу переїхати в Україну</h2>
      <p>
        Якщо ви думали, планували, писали десь в коментарях про переїзд після війни в Україну, припиніть. Перестаньте
        писати про це, говорити про це і навіть думати. Вас тут не чекають. Україна бореться за те, щоб максимально
        дистанціюватись від росії, росіян і всього що з цим пов'язано. А ваші заяви "Вот после войны перееду на Украину"
        вкрай мерзенні і лише посилюють ненависть до росіян. Уявіть: Один сусід засрав власне житло, затопив сусіда
        знизу, почекав поки останній зробить ремонт а тоді переїхав до нього на все готове, пальцем об палець не
        вдаривши. Саме так ви й виглядаєте.
      </p>

      <h2>Я нічого не зробив, за що мені це все?</h2>
      <p>Життя штука несправедлива. Змирись.</p>

      <h2>Як допомогти</h2>
      <p>
        Якщо ви подумали, що ви "маленька людина яка ніхуя не може" — забудьте. Вас спеціально так виховували. Вам
        навіяли, що ви маленький слабкий, нікчемний, громадянин, який ніхуя не вирішує і ні на що не здатен. Кожен
        здатен бодай на щось. Я не буду закликати когось йти на мітинги чи надавати якусь матеріальну допомогу. Це
        марно. Але ось кілька безпечних варіантів:
      </p>

      <ul class="list-disc">
        <li>
          Допомога Кібер-військам України. Українські ІТ-шники написали купу софту для кібер-атак.
          <external-link
            href="https://telegra.ph/Death-by-1000-needles-03-17"
          >
            Ось одна з таких програм
          </external-link>
          . Вам достатньо запустити її
          на своєму пристрої і це вже допоможе.
        </li>
        <li>
          Спростовувати новини.
          <external-link
            href="https://docs.google.com/spreadsheets/u/0/d/1t7zq1qrm0JAbOp_yWW3CkK7D5qnHr4hF4f0-TURwTg4/htmlview"
          >
            Росія
            веде надзвичайно потужну інформаційну війну
          </external-link>
          . Спростовуйте новини і поширюйте спростування. Зазвичай це не
          дуже важко.
        </li>
        <li>
          Знайшли фейкову новину чи аккаунт який їх розсилає?
          <external-link href="https://t.me/stopdrugsbot">
            Повідомляйте про них
          </external-link>
        </li>
        <li>
          Листівки та вуличне мистецтво (це мені здається найкращий варіант щодо співвідношення безпека/результат)
        </li>
        <li>Ведіть розмови про жахіття війни з знайомими та близькими</li>
        <li>Робіть дописи в соц. мережах</li>
        <li>
          Відмовляйтесь від призову. <external-link href="https://t.me/agsnowarbot">
            Чат-бот з юридичною допомогою росіянам щодо відмови від служби в армії
          </external-link>.
        </li>
      </ul>

      <h2>Майбутнє</h2>
      <p>
        У мене багато планів на цей додаток, багато чого я хочу в цього додати. І якщо мені вдасться дожити до мирних
        часів
        і якщо я не вмру з голоду, мене не поховає під завалами будинку чи не розстріляє проїжджачий мимо БТР то все
        буде.
      </p>
    </details>
  </div>
</template>

<style scoped>
div {
  max-width: 800px;
  width: 100%;
  margin: auto;
  text-align: center;
}

span.glory {
  font-size: 2rem;
}


details {
  text-align: left;
}

summary {
  text-align: center;
  list-style: none;
}

summary > span, a {
  border-bottom: 1px dotted;
  cursor: pointer;
  color: rgb(66, 184, 131);
}

summary > span:hover, summary > span:focus-visible, a:hover, a:focus-visible {
  border-bottom-style: solid;
}


h2 {
  margin: 2rem 0 1rem 0;
}

p {
  margin: 1rem 0;
}
</style>

